This family instance has too many [Edges and Faces]. Remove unnecessary geometry or split the instance into multiple instances.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId TooManyFacesEdges { get; }
  Visual Basic
Public Shared ReadOnly Property TooManyFacesEdges As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ TooManyFacesEdges {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures GeometryFailures Class
  Autodesk.Revit.DB Namespace